//
//  BKPasscodeView.strings
//  Nextcloud iOS
//
//  Copyright (c) 2017 TWS. All rights reserved.
//
//  Author Marino Faggiana <m.faggiana@twsweb.it>
//
//  This program is free software: you can redistribute it and/or modify
//  it under the terms of the GNU General Public License as published by
//  the Free Software Foundation, either version 3 of the License, or
//  (at your option) any later version.
//
//  This program is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU General Public License for more details.
//
//  You should have received a copy of the GNU General Public License
//  along with this program.  If not, see <http://www.gnu.org/licenses/>.
//

"%d Failed Passcode Attempts" = "安全码 %d 次尝试失败";
"%d Failed Password Attempts" = "密码 %d 次尝试失败";

"1 Failed Passcode Attempt" = "安全码 1 次尝试失败";
"1 Failed Password Attempt" = "密码 1 次尝试失败";

"Do you want to use Touch ID for authentication?" = "Do you want to use Touch/Face ID for authentication?";

"Done" = "完成";

"Enable Touch ID" = "Enable Touch/Face ID";

"Enter a different passcode. Cannot re-use the same passcode." = "输入一个不同的 passcode。同一个 passcode 不能重复使用。";
"Enter a different password. Cannot re-use the same password." = "输入一个不同的密码。同一个密码不能重复使用。";

"Enter a passcode" = "输入安全码";
"Enter a password" = "输入密码";

"Enter your new passcode" = "输入新安全码";
"Enter your new password" = "输入新密码";

"Enter your old passcode" = "输入旧安全码";
"Enter your old password" = "输入旧密码";

"Enter your passcode" = "输入安全码";
"Enter your password" = "输入密码";

"Invalid Passcode" = "安全码无效";
"Invalid Password" = "密码无效";

"Passcodes did not match.\nTry again." = "安全码不匹配。\n再试一次。";
"Password did not match.\nTry again." = "密码不匹配。\n再试一次。";

"Re-enter your passcode" = "再次输入安全码";
"Re-enter your password" = "再次输入密码";

"Try again in %d minutes" = "%d 分钟后再试";

"Try again in 1 minute" = "1 分钟后再试";
